import matplotlib.pyplot as plt
import numpy as np
plt.rc('font', family='NanumGothic')

ptp1= [389.05, 349.9, 239.54, 321.03, 270.75, 315.75, 306.81, 534.54]
ptp2= [345.4, 341.37, 226.02, 273.93, 267.44, 293.74, 291.97, 505.29]
ptp3 = [349.79, 398.54, 220.61, 288.43, 267.75, 355.42, 333.44, 456.25]

ptr1 = [85.6, 80.34, 58.96, 94.05, 77.13, 61.62, 73.69, 126.35]
ptr2 = [85.26, 75.85, 66.73, 100.87, 82.36 ,55.57 ,61.91, 81.01]
ptr3 = [83.1, 81.15, 64.6, 80.48, 78.94, 49.33, 64.77, 87.29]

bsp1 = [44, 40, 263, 131, 116, 137, 122, 58]
bsp2 = [38, 85 ,261, 165, 59, 143, 149, 70]
bsp3 = [45, 44, 253, 190, 98, 167, 128, 91]

typo1 = [140, 224, 716, 415, 411, 410, 401, 179]
typo2 = [144, 318, 718, 566, 303, 431, 461, 237]
typo3 = [168, 222, 708, 541, 358, 469, 388, 279]


plt.xlabel("평균 Press-release 시간 간격")
plt.ylabel("혈중 알코올 농도")

plt.xlim(0,600)
plt.ylim(-0.05,0.15)
plt.xticks(np.arange(0,600,step=100))
plt.yticks(np.arange(0,0.15,step=0.05))

plt.plot(ptp1, [0]*len(ptp1),'ro', label='PTP 1');
plt.plot(ptp2, [0.05]*len(ptp1),'go', label='PTP 2');
plt.plot(ptp3, [0.1]*len(ptp1),'bo', label='PTP 3');
plt.plot([0,2941.9404532726960], [0.056337597321837574,0])

plt.legend(loc='best')

plt.show()
